In [1]:
import numpy as np
import pandas as pd

In [2]:
print(pd.Series([3,2,4,76,-54,65,-87,3]))

0     3
1     2
2     4
3    76
4   -54
5    65
6   -87
7     3
dtype: int64

In [3]:

sales=pd.Series([100,2300,4600,3000],index=['a','b','c','d'],dtype='object',name='salary',copy=True)

In [4]:
print(sales.values)
print(sales.index)
print(sales)

[100 2300 4600 3000]
Index(['a', 'b', 'c', 'd'], dtype='object')
a     100
b    2300
c    4600
d    3000
Name: salary, dtype: object

In [5]:
pdSeries=pd.Series(data=['name','owais','age','18'],index=[1,2,3,4],copy=True)

In [6]:
print(pdSeries[1])
print(pdSeries[[2,4]])
print(pdSeries[pdSeries!='name'])

name
2    owais
4       18
dtype: object
2    owais
3      age
4       18
dtype: object

In [7]:
data={'name':"owais Ali" , 'fname':'Arshad Ali' , 'age' :'18'}

In [8]:
Data=pd.Series(data=data,index=['fname','name','age','education'])

In [9]:
Data

fname        Arshad Ali
name          owais Ali
age                  18
education           NaN
dtype: object

In [10]:
Data.isnull()

fname        False
name         False
age          False
education     True
dtype: bool

In [11]:
index=['a','b','c','d']
a=pd.Series([1,2,3,4],index=index)
b=pd.Series([5,6,7,8],index=index)
ab={'a':a,'b':b}
print(pd.DataFrame(ab))

   a  b
a  1  5
b  2  6
c  3  7
d  4  8

In [12]:
df=pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])
print(df)
print('\n')

print(np.abs(df))
print('\n')

print(df['d'].min())
print('\n')

print(df['d'].max())
print('\n')

print(df['d'].min()-df['d'].max())
print('\n')

f= lambda x: x.max()-x.min()#we use lambda where we don't give anyname to function and use the function directly
print(df.apply(f,axis=0))#perform colunm wise operation
print('/n')
print(df.apply(f,axis=1))#perform row wise operation

def min_max(x):
    minimum=x.min()
    maximum=x.max()
    result=maximum-minimum
   # return(pd.DataFrame([maximum,minimum,result],columns=['minimum','maximum','result']))
    return pd.Series([minimum,maximum],index=['min','max'])
print(df.apply(min_max))

          a         b         c         d
0  0.461901 -0.507472  2.085049  0.797407
1  0.650939  0.888244 -0.026793  0.612302
2 -0.446633 -0.296196  0.176772 -0.619037


          a         b         c         d
0  0.461901  0.507472  2.085049  0.797407
1  0.650939  0.888244  0.026793  0.612302
2  0.446633  0.296196  0.176772  0.619037


-0.6190369615092036


0.7974072429570767


-1.4164442044662802


a    1.097572
b    1.395716
c    2.111842
d    1.416444
dtype: float64
/n
0    2.592521
1    0.915037
2    0.795809
dtype: float64
            a         b         c         d
min -0.446633 -0.507472 -0.026793 -0.619037
max  0.650939  0.888244  2.085049  0.797407

In [13]:
data={"TAX":['38,800,000,000','125,400,000,000','1,200,000,000','7,840,000,000'],'POPULATION':
     ['47,890,000','110,012,442','35,530,000','12,340,000']}
Tax_index=pd.DataFrame(data,index=[0,1,2,3])

In [14]:
#print(Tax_index.loc[['Sindh','Punjab'],['TAX']])
print(Tax_index.iloc[2,1])
Tax_index

35,530,000

               TAX   POPULATION
0   38,800,000,000   47,890,000
1  125,400,000,000  110,012,442
2    1,200,000,000   35,530,000
3    7,840,000,000   12,340,000

In [15]:
"""Sindh	38,800,000,000	47,890,000
Punjab	125,400,000,000	110,012,442
KPK	1,200,000,000	35,530,000
Blochistan	7,840,000,000	12,340,000
​
1
​"""
Tax_index

               TAX   POPULATION
0   38,800,000,000   47,890,000
1  125,400,000,000  110,012,442
2    1,200,000,000   35,530,000
3    7,840,000,000   12,340,000

In [16]:
name=np.array(['owais','ali','arshad','shaheen','uzair','usaid','humaid','sohaib','ijaz','rashid'])
Name=np.array(['ali','owais','ahmed','anees','arshad','zakir','shaheen','humaid','anas','usaid'])
result=np.where(name==Name)
result

(array([], dtype=int64),)

In [17]:
print(Tax_index.reindex(range(9)))
print()
print(Tax_index.reindex(range(9),method='ffill'))

               TAX   POPULATION
0   38,800,000,000   47,890,000
1  125,400,000,000  110,012,442
2    1,200,000,000   35,530,000
3    7,840,000,000   12,340,000
4              NaN          NaN
5              NaN          NaN
6              NaN          NaN
7              NaN          NaN
8              NaN          NaN

               TAX   POPULATION
0   38,800,000,000   47,890,000
1  125,400,000,000  110,012,442
2    1,200,000,000   35,530,000
3    7,840,000,000   12,340,000
4    7,840,000,000   12,340,000
5    7,840,000,000   12,340,000
6    7,840,000,000   12,340,000
7    7,840,000,000   12,340,000
8    7,840,000,000   12,340,000

In [19]:
html_data=pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/")

In [29]:
data=html_data[:][:]

In [27]:
print(len(html_data))

1

In [33]:
data=data[0][:]

In [40]:
data

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [45]:
import datetime as dt
pd.date_range('26/6/2002',periods=198)

DatetimeIndex(['2002-06-26', '2002-06-27', '2002-06-28', '2002-06-29',
               '2002-06-30', '2002-07-01', '2002-07-02', '2002-07-03',
               '2002-07-04', '2002-07-05',
               ...
               '2002-12-31', '2003-01-01', '2003-01-02', '2003-01-03',
               '2003-01-04', '2003-01-05', '2003-01-06', '2003-01-07',
               '2003-01-08', '2003-01-09'],
              dtype='datetime64[ns]', length=198, freq='D')

In [48]:
date=pd.to_datetime(data['Closing Date'])

In [55]:
date=np.array(date)

In [58]:
#np.unique(date)

In [3]:
import sqlite3 as sqlt

In [4]:
query=""" CREATE TABLE test(a VARCHAR (20),
      b VARCHER (20), c REAL, d INTEGER); """

con=sqlt.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [8]:
data=[(0,23,45,67),
     ('owais',92,'ideal','onward'),
     ('to','little','groove',98)]
stmt="INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt,data)
con.commit()

In [11]:
coursor=con.execute("select * from test")
rows=coursor.fetchall()

In [12]:
df=pd.DataFrame(rows,columns=[x[0] for x in coursor.description])
df

       a       b       c       d
0      0      23      45      67
1  owais      92   ideal  onward
2     to  little  groove      98

In [13]:
import sqlalchemy as sqla